Revit 2027 API
ElectricalPhaseLine Enumeration
 This attribute defines the electrical phase.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ElectricalPhaseLine
Public Enumeration ElectricalPhaseLine
public enum class ElectricalPhaseLine
type ElectricalPhaseLine
Members
Member name | Value | Description
A | 0 |  Phase A
B | 1 |  Phase B
C | 2 |  Phase C
Invalid | -1 |  Not defined.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace